Revit 2027 API
DimensionSegmentArray.Append Method
Add the item to the end of the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual void Append(
	DimensionSegment item
)
Public Overridable Sub Append (
	item As DimensionSegment
)
public:
virtual void Append(
	DimensionSegment^ item
)
abstract Append :
        item : DimensionSegment -> unit
override Append :
        item : DimensionSegment -> unit
Parameters
item DimensionSegment
The item to be added.
See Also
Reference
DimensionSegmentArray Class
Autodesk.Revit.DB Namespace